espressif/esp-idf/components/soc/esp32h4/register/soc/soc_etm_reg.h
/** SOC_ETM_EVT_ST6_REG register
 *  Events trigger status register
 */
#define SOC_ETM_EVT_ST6_REG (DR_REG_SOC_ETM_BASE + 0x1d8)
/** SOC_ETM_GDMA_EVT_OUT_FIFO_EMPTY_CH3_ST : R/WTC/SS; bitpos: [0]; default: 0;
 *  Represents GDMA_evt_out_fifo_empty_ch3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_EVT_OUT_FIFO_EMPTY_CH3_ST    (BIT(0))
#define SOC_ETM_GDMA_EVT_OUT_FIFO_EMPTY_CH3_ST_M  (SOC_ETM_GDMA_EVT_OUT_FIFO_EMPTY_CH3_ST_V << SOC_ETM_GDMA_EVT_OUT_FIFO_EMPTY_CH3_ST_S)
#define SOC_ETM_GDMA_EVT_OUT_FIFO_EMPTY_CH3_ST_V  0x00000001U
#define SOC_ETM_GDMA_EVT_OUT_FIFO_EMPTY_CH3_ST_S  0
/** SOC_ETM_GDMA_EVT_OUT_FIFO_EMPTY_CH4_ST : R/WTC/SS; bitpos: [1]; default: 0;
 *  Represents GDMA_evt_out_fifo_empty_ch4 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_EVT_OUT_FIFO_EMPTY_CH4_ST    (BIT(1))
#define SOC_ETM_GDMA_EVT_OUT_FIFO_EMPTY_CH4_ST_M  (SOC_ETM_GDMA_EVT_OUT_FIFO_EMPTY_CH4_ST_V << SOC_ETM_GDMA_EVT_OUT_FIFO_EMPTY_CH4_ST_S)
#define SOC_ETM_GDMA_EVT_OUT_FIFO_EMPTY_CH4_ST_V  0x00000001U
#define SOC_ETM_GDMA_EVT_OUT_FIFO_EMPTY_CH4_ST_S  1
/** SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH0_ST : R/WTC/SS; bitpos: [2]; default: 0;
 *  Represents GDMA_evt_out_fifo_full_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH0_ST    (BIT(2))
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH0_ST_M  (SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH0_ST_V << SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH0_ST_S)
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH0_ST_V  0x00000001U
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH0_ST_S  2
/** SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH1_ST : R/WTC/SS; bitpos: [3]; default: 0;
 *  Represents GDMA_evt_out_fifo_full_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH1_ST    (BIT(3))
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH1_ST_M  (SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH1_ST_V << SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH1_ST_S)
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH1_ST_V  0x00000001U
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH1_ST_S  3
/** SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH2_ST : R/WTC/SS; bitpos: [4]; default: 0;
 *  Represents GDMA_evt_out_fifo_full_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH2_ST    (BIT(4))
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH2_ST_M  (SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH2_ST_V << SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH2_ST_S)
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH2_ST_V  0x00000001U
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH2_ST_S  4
/** SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH3_ST : R/WTC/SS; bitpos: [5]; default: 0;
 *  Represents GDMA_evt_out_fifo_full_ch3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH3_ST    (BIT(5))
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH3_ST_M  (SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH3_ST_V << SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH3_ST_S)
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH3_ST_V  0x00000001U
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH3_ST_S  5
/** SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH4_ST : R/WTC/SS; bitpos: [6]; default: 0;
 *  Represents GDMA_evt_out_fifo_full_ch4 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH4_ST    (BIT(6))
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH4_ST_M  (SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH4_ST_V << SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH4_ST_S)
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH4_ST_V  0x00000001U
#define SOC_ETM_GDMA_EVT_OUT_FIFO_FULL_CH4_ST_S  6
/** SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST : R/WTC/SS; bitpos: [7]; default: 0;
 *  Represents PMU_evt_sleep_weekup trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST    (BIT(7))
#define SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_M  (SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_V << SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_S)
#define SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_V  0x00000001U
#define SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_S  7
/** SOC_ETM_MODEM_EVT_G0_ST : R/WTC/SS; bitpos: [8]; default: 0;
 *  Represents MODEM_evt_g0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_EVT_G0_ST    (BIT(8))
#define SOC_ETM_MODEM_EVT_G0_ST_M  (SOC_ETM_MODEM_EVT_G0_ST_V << SOC_ETM_MODEM_EVT_G0_ST_S)
#define SOC_ETM_MODEM_EVT_G0_ST_V  0x00000001U
#define SOC_ETM_MODEM_EVT_G0_ST_S  8
/** SOC_ETM_MODEM_EVT_G1_ST : R/WTC/SS; bitpos: [9]; default: 0;
 *  Represents MODEM_evt_g1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_EVT_G1_ST    (BIT(9))
#define SOC_ETM_MODEM_EVT_G1_ST_M  (SOC_ETM_MODEM_EVT_G1_ST_V << SOC_ETM_MODEM_EVT_G1_ST_S)
#define SOC_ETM_MODEM_EVT_G1_ST_V  0x00000001U
#define SOC_ETM_MODEM_EVT_G1_ST_S  9
/** SOC_ETM_MODEM_EVT_G2_ST : R/WTC/SS; bitpos: [10]; default: 0;
 *  Represents MODEM_evt_g2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_EVT_G2_ST    (BIT(10))
#define SOC_ETM_MODEM_EVT_G2_ST_M  (SOC_ETM_MODEM_EVT_G2_ST_V << SOC_ETM_MODEM_EVT_G2_ST_S)
#define SOC_ETM_MODEM_EVT_G2_ST_V  0x00000001U
#define SOC_ETM_MODEM_EVT_G2_ST_S  10
/** SOC_ETM_MODEM_EVT_G3_ST : R/WTC/SS; bitpos: [11]; default: 0;
 *  Represents MODEM_evt_g3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_EVT_G3_ST    (BIT(11))
#define SOC_ETM_MODEM_EVT_G3_ST_M  (SOC_ETM_MODEM_EVT_G3_ST_V << SOC_ETM_MODEM_EVT_G3_ST_S)
#define SOC_ETM_MODEM_EVT_G3_ST_V  0x00000001U
#define SOC_ETM_MODEM_EVT_G3_ST_S  11
/** SOC_ETM_ZERO_DET_EVT_CHANNEL_1_POS_ST : R/WTC/SS; bitpos: [12]; default: 0;
 *  Represents ZERO_DET_evt_channel_1_pos trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_1_POS_ST    (BIT(12))
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_1_POS_ST_M  (SOC_ETM_ZERO_DET_EVT_CHANNEL_1_POS_ST_V << SOC_ETM_ZERO_DET_EVT_CHANNEL_1_POS_ST_S)
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_1_POS_ST_V  0x00000001U
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_1_POS_ST_S  12
/** SOC_ETM_ZERO_DET_EVT_CHANNEL_2_POS_ST : R/WTC/SS; bitpos: [13]; default: 0;
 *  Represents ZERO_DET_evt_channel_2_pos trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_2_POS_ST    (BIT(13))
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_2_POS_ST_M  (SOC_ETM_ZERO_DET_EVT_CHANNEL_2_POS_ST_V << SOC_ETM_ZERO_DET_EVT_CHANNEL_2_POS_ST_S)
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_2_POS_ST_V  0x00000001U
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_2_POS_ST_S  13
/** SOC_ETM_ZERO_DET_EVT_CHANNEL_3_POS_ST : R/WTC/SS; bitpos: [14]; default: 0;
 *  Represents ZERO_DET_evt_channel_3_pos trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_3_POS_ST    (BIT(14))
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_3_POS_ST_M  (SOC_ETM_ZERO_DET_EVT_CHANNEL_3_POS_ST_V << SOC_ETM_ZERO_DET_EVT_CHANNEL_3_POS_ST_S)
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_3_POS_ST_V  0x00000001U
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_3_POS_ST_S  14
/** SOC_ETM_ZERO_DET_EVT_CHANNEL_1_NEG_ST : R/WTC/SS; bitpos: [15]; default: 0;
 *  Represents ZERO_DET_evt_channel_1_neg trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_1_NEG_ST    (BIT(15))
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_1_NEG_ST_M  (SOC_ETM_ZERO_DET_EVT_CHANNEL_1_NEG_ST_V << SOC_ETM_ZERO_DET_EVT_CHANNEL_1_NEG_ST_S)
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_1_NEG_ST_V  0x00000001U
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_1_NEG_ST_S  15
/** SOC_ETM_ZERO_DET_EVT_CHANNEL_2_NEG_ST : R/WTC/SS; bitpos: [16]; default: 0;
 *  Represents ZERO_DET_evt_channel_2_neg trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_2_NEG_ST    (BIT(16))
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_2_NEG_ST_M  (SOC_ETM_ZERO_DET_EVT_CHANNEL_2_NEG_ST_V << SOC_ETM_ZERO_DET_EVT_CHANNEL_2_NEG_ST_S)
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_2_NEG_ST_V  0x00000001U
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_2_NEG_ST_S  16
/** SOC_ETM_ZERO_DET_EVT_CHANNEL_3_NEG_ST : R/WTC/SS; bitpos: [17]; default: 0;
 *  Represents ZERO_DET_evt_channel_3_neg trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_3_NEG_ST    (BIT(17))
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_3_NEG_ST_M  (SOC_ETM_ZERO_DET_EVT_CHANNEL_3_NEG_ST_V << SOC_ETM_ZERO_DET_EVT_CHANNEL_3_NEG_ST_S)
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_3_NEG_ST_V  0x00000001U
#define SOC_ETM_ZERO_DET_EVT_CHANNEL_3_NEG_ST_S  17

