espressif/esp-idf/components/soc/esp32h4/register/soc/soc_etm_reg.h
/** SOC_ETM_TASK_ST2_REG register
 *  Tasks trigger status register
 */
#define SOC_ETM_TASK_ST2_REG (DR_REG_SOC_ETM_BASE + 0x1f0)
/** SOC_ETM_LEDC_TASK_TIMER0_PAUSE_ST : R/WTC/SS; bitpos: [0]; default: 0;
 *  Represents LEDC_task_timer0_pause trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_TIMER0_PAUSE_ST    (BIT(0))
#define SOC_ETM_LEDC_TASK_TIMER0_PAUSE_ST_M  (SOC_ETM_LEDC_TASK_TIMER0_PAUSE_ST_V << SOC_ETM_LEDC_TASK_TIMER0_PAUSE_ST_S)
#define SOC_ETM_LEDC_TASK_TIMER0_PAUSE_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_TIMER0_PAUSE_ST_S  0
/** SOC_ETM_LEDC_TASK_TIMER1_PAUSE_ST : R/WTC/SS; bitpos: [1]; default: 0;
 *  Represents LEDC_task_timer1_pause trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_TIMER1_PAUSE_ST    (BIT(1))
#define SOC_ETM_LEDC_TASK_TIMER1_PAUSE_ST_M  (SOC_ETM_LEDC_TASK_TIMER1_PAUSE_ST_V << SOC_ETM_LEDC_TASK_TIMER1_PAUSE_ST_S)
#define SOC_ETM_LEDC_TASK_TIMER1_PAUSE_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_TIMER1_PAUSE_ST_S  1
/** SOC_ETM_LEDC_TASK_TIMER2_PAUSE_ST : R/WTC/SS; bitpos: [2]; default: 0;
 *  Represents LEDC_task_timer2_pause trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_TIMER2_PAUSE_ST    (BIT(2))
#define SOC_ETM_LEDC_TASK_TIMER2_PAUSE_ST_M  (SOC_ETM_LEDC_TASK_TIMER2_PAUSE_ST_V << SOC_ETM_LEDC_TASK_TIMER2_PAUSE_ST_S)
#define SOC_ETM_LEDC_TASK_TIMER2_PAUSE_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_TIMER2_PAUSE_ST_S  2
/** SOC_ETM_LEDC_TASK_TIMER3_PAUSE_ST : R/WTC/SS; bitpos: [3]; default: 0;
 *  Represents LEDC_task_timer3_pause trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_TIMER3_PAUSE_ST    (BIT(3))
#define SOC_ETM_LEDC_TASK_TIMER3_PAUSE_ST_M  (SOC_ETM_LEDC_TASK_TIMER3_PAUSE_ST_V << SOC_ETM_LEDC_TASK_TIMER3_PAUSE_ST_S)
#define SOC_ETM_LEDC_TASK_TIMER3_PAUSE_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_TIMER3_PAUSE_ST_S  3
/** SOC_ETM_LEDC_TASK_FADE_RESTART_CH0_ST : R/WTC/SS; bitpos: [4]; default: 0;
 *  Represents LEDC_task_fade_restart_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH0_ST    (BIT(4))
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH0_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESTART_CH0_ST_V << SOC_ETM_LEDC_TASK_FADE_RESTART_CH0_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH0_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH0_ST_S  4
/** SOC_ETM_LEDC_TASK_FADE_RESTART_CH1_ST : R/WTC/SS; bitpos: [5]; default: 0;
 *  Represents LEDC_task_fade_restart_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH1_ST    (BIT(5))
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH1_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESTART_CH1_ST_V << SOC_ETM_LEDC_TASK_FADE_RESTART_CH1_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH1_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH1_ST_S  5
/** SOC_ETM_LEDC_TASK_FADE_RESTART_CH2_ST : R/WTC/SS; bitpos: [6]; default: 0;
 *  Represents LEDC_task_fade_restart_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH2_ST    (BIT(6))
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH2_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESTART_CH2_ST_V << SOC_ETM_LEDC_TASK_FADE_RESTART_CH2_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH2_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH2_ST_S  6
/** SOC_ETM_LEDC_TASK_FADE_RESTART_CH3_ST : R/WTC/SS; bitpos: [7]; default: 0;
 *  Represents LEDC_task_fade_restart_ch3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH3_ST    (BIT(7))
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH3_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESTART_CH3_ST_V << SOC_ETM_LEDC_TASK_FADE_RESTART_CH3_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH3_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH3_ST_S  7
/** SOC_ETM_LEDC_TASK_FADE_RESTART_CH4_ST : R/WTC/SS; bitpos: [8]; default: 0;
 *  Represents LEDC_task_fade_restart_ch4 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH4_ST    (BIT(8))
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH4_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESTART_CH4_ST_V << SOC_ETM_LEDC_TASK_FADE_RESTART_CH4_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH4_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH4_ST_S  8
/** SOC_ETM_LEDC_TASK_FADE_RESTART_CH5_ST : R/WTC/SS; bitpos: [9]; default: 0;
 *  Represents LEDC_task_fade_restart_ch5 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH5_ST    (BIT(9))
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH5_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESTART_CH5_ST_V << SOC_ETM_LEDC_TASK_FADE_RESTART_CH5_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH5_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH5_ST_S  9
/** SOC_ETM_LEDC_TASK_FADE_RESTART_CH6_ST : R/WTC/SS; bitpos: [10]; default: 0;
 *  Represents LEDC_task_fade_restart_ch6 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH6_ST    (BIT(10))
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH6_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESTART_CH6_ST_V << SOC_ETM_LEDC_TASK_FADE_RESTART_CH6_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH6_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH6_ST_S  10
/** SOC_ETM_LEDC_TASK_FADE_RESTART_CH7_ST : R/WTC/SS; bitpos: [11]; default: 0;
 *  Represents LEDC_task_fade_restart_ch7 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH7_ST    (BIT(11))
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH7_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESTART_CH7_ST_V << SOC_ETM_LEDC_TASK_FADE_RESTART_CH7_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH7_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESTART_CH7_ST_S  11
/** SOC_ETM_LEDC_TASK_FADE_PAUSE_CH0_ST : R/WTC/SS; bitpos: [12]; default: 0;
 *  Represents LEDC_task_fade_pause_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH0_ST    (BIT(12))
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH0_ST_M  (SOC_ETM_LEDC_TASK_FADE_PAUSE_CH0_ST_V << SOC_ETM_LEDC_TASK_FADE_PAUSE_CH0_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH0_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH0_ST_S  12
/** SOC_ETM_LEDC_TASK_FADE_PAUSE_CH1_ST : R/WTC/SS; bitpos: [13]; default: 0;
 *  Represents LEDC_task_fade_pause_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH1_ST    (BIT(13))
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH1_ST_M  (SOC_ETM_LEDC_TASK_FADE_PAUSE_CH1_ST_V << SOC_ETM_LEDC_TASK_FADE_PAUSE_CH1_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH1_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH1_ST_S  13
/** SOC_ETM_LEDC_TASK_FADE_PAUSE_CH2_ST : R/WTC/SS; bitpos: [14]; default: 0;
 *  Represents LEDC_task_fade_pause_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH2_ST    (BIT(14))
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH2_ST_M  (SOC_ETM_LEDC_TASK_FADE_PAUSE_CH2_ST_V << SOC_ETM_LEDC_TASK_FADE_PAUSE_CH2_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH2_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH2_ST_S  14
/** SOC_ETM_LEDC_TASK_FADE_PAUSE_CH3_ST : R/WTC/SS; bitpos: [15]; default: 0;
 *  Represents LEDC_task_fade_pause_ch3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH3_ST    (BIT(15))
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH3_ST_M  (SOC_ETM_LEDC_TASK_FADE_PAUSE_CH3_ST_V << SOC_ETM_LEDC_TASK_FADE_PAUSE_CH3_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH3_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH3_ST_S  15
/** SOC_ETM_LEDC_TASK_FADE_PAUSE_CH4_ST : R/WTC/SS; bitpos: [16]; default: 0;
 *  Represents LEDC_task_fade_pause_ch4 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH4_ST    (BIT(16))
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH4_ST_M  (SOC_ETM_LEDC_TASK_FADE_PAUSE_CH4_ST_V << SOC_ETM_LEDC_TASK_FADE_PAUSE_CH4_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH4_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH4_ST_S  16
/** SOC_ETM_LEDC_TASK_FADE_PAUSE_CH5_ST : R/WTC/SS; bitpos: [17]; default: 0;
 *  Represents LEDC_task_fade_pause_ch5 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH5_ST    (BIT(17))
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH5_ST_M  (SOC_ETM_LEDC_TASK_FADE_PAUSE_CH5_ST_V << SOC_ETM_LEDC_TASK_FADE_PAUSE_CH5_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH5_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH5_ST_S  17
/** SOC_ETM_LEDC_TASK_FADE_PAUSE_CH6_ST : R/WTC/SS; bitpos: [18]; default: 0;
 *  Represents LEDC_task_fade_pause_ch6 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH6_ST    (BIT(18))
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH6_ST_M  (SOC_ETM_LEDC_TASK_FADE_PAUSE_CH6_ST_V << SOC_ETM_LEDC_TASK_FADE_PAUSE_CH6_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH6_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH6_ST_S  18
/** SOC_ETM_LEDC_TASK_FADE_PAUSE_CH7_ST : R/WTC/SS; bitpos: [19]; default: 0;
 *  Represents LEDC_task_fade_pause_ch7 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH7_ST    (BIT(19))
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH7_ST_M  (SOC_ETM_LEDC_TASK_FADE_PAUSE_CH7_ST_V << SOC_ETM_LEDC_TASK_FADE_PAUSE_CH7_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH7_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_PAUSE_CH7_ST_S  19
/** SOC_ETM_LEDC_TASK_FADE_RESUME_CH0_ST : R/WTC/SS; bitpos: [20]; default: 0;
 *  Represents LEDC_task_fade_resume_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH0_ST    (BIT(20))
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH0_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESUME_CH0_ST_V << SOC_ETM_LEDC_TASK_FADE_RESUME_CH0_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH0_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH0_ST_S  20
/** SOC_ETM_LEDC_TASK_FADE_RESUME_CH1_ST : R/WTC/SS; bitpos: [21]; default: 0;
 *  Represents LEDC_task_fade_resume_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH1_ST    (BIT(21))
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH1_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESUME_CH1_ST_V << SOC_ETM_LEDC_TASK_FADE_RESUME_CH1_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH1_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH1_ST_S  21
/** SOC_ETM_LEDC_TASK_FADE_RESUME_CH2_ST : R/WTC/SS; bitpos: [22]; default: 0;
 *  Represents LEDC_task_fade_resume_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH2_ST    (BIT(22))
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH2_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESUME_CH2_ST_V << SOC_ETM_LEDC_TASK_FADE_RESUME_CH2_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH2_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH2_ST_S  22
/** SOC_ETM_LEDC_TASK_FADE_RESUME_CH3_ST : R/WTC/SS; bitpos: [23]; default: 0;
 *  Represents LEDC_task_fade_resume_ch3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH3_ST    (BIT(23))
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH3_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESUME_CH3_ST_V << SOC_ETM_LEDC_TASK_FADE_RESUME_CH3_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH3_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH3_ST_S  23
/** SOC_ETM_LEDC_TASK_FADE_RESUME_CH4_ST : R/WTC/SS; bitpos: [24]; default: 0;
 *  Represents LEDC_task_fade_resume_ch4 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH4_ST    (BIT(24))
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH4_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESUME_CH4_ST_V << SOC_ETM_LEDC_TASK_FADE_RESUME_CH4_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH4_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH4_ST_S  24
/** SOC_ETM_LEDC_TASK_FADE_RESUME_CH5_ST : R/WTC/SS; bitpos: [25]; default: 0;
 *  Represents LEDC_task_fade_resume_ch5 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH5_ST    (BIT(25))
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH5_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESUME_CH5_ST_V << SOC_ETM_LEDC_TASK_FADE_RESUME_CH5_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH5_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH5_ST_S  25
/** SOC_ETM_LEDC_TASK_FADE_RESUME_CH6_ST : R/WTC/SS; bitpos: [26]; default: 0;
 *  Represents LEDC_task_fade_resume_ch6 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH6_ST    (BIT(26))
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH6_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESUME_CH6_ST_V << SOC_ETM_LEDC_TASK_FADE_RESUME_CH6_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH6_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH6_ST_S  26
/** SOC_ETM_LEDC_TASK_FADE_RESUME_CH7_ST : R/WTC/SS; bitpos: [27]; default: 0;
 *  Represents LEDC_task_fade_resume_ch7 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH7_ST    (BIT(27))
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH7_ST_M  (SOC_ETM_LEDC_TASK_FADE_RESUME_CH7_ST_V << SOC_ETM_LEDC_TASK_FADE_RESUME_CH7_ST_S)
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH7_ST_V  0x00000001U
#define SOC_ETM_LEDC_TASK_FADE_RESUME_CH7_ST_S  27
/** SOC_ETM_TG0_TASK_CNT_START_TIMER0_ST : R/WTC/SS; bitpos: [28]; default: 0;
 *  Represents TG0_task_cnt_start_timer0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TG0_TASK_CNT_START_TIMER0_ST    (BIT(28))
#define SOC_ETM_TG0_TASK_CNT_START_TIMER0_ST_M  (SOC_ETM_TG0_TASK_CNT_START_TIMER0_ST_V << SOC_ETM_TG0_TASK_CNT_START_TIMER0_ST_S)
#define SOC_ETM_TG0_TASK_CNT_START_TIMER0_ST_V  0x00000001U
#define SOC_ETM_TG0_TASK_CNT_START_TIMER0_ST_S  28
/** SOC_ETM_TG0_TASK_ALARM_START_TIMER0_ST : R/WTC/SS; bitpos: [29]; default: 0;
 *  Represents TG0_task_alarm_start_timer0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TG0_TASK_ALARM_START_TIMER0_ST    (BIT(29))
#define SOC_ETM_TG0_TASK_ALARM_START_TIMER0_ST_M  (SOC_ETM_TG0_TASK_ALARM_START_TIMER0_ST_V << SOC_ETM_TG0_TASK_ALARM_START_TIMER0_ST_S)
#define SOC_ETM_TG0_TASK_ALARM_START_TIMER0_ST_V  0x00000001U
#define SOC_ETM_TG0_TASK_ALARM_START_TIMER0_ST_S  29
/** SOC_ETM_TG0_TASK_CNT_STOP_TIMER0_ST : R/WTC/SS; bitpos: [30]; default: 0;
 *  Represents TG0_task_cnt_stop_timer0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TG0_TASK_CNT_STOP_TIMER0_ST    (BIT(30))
#define SOC_ETM_TG0_TASK_CNT_STOP_TIMER0_ST_M  (SOC_ETM_TG0_TASK_CNT_STOP_TIMER0_ST_V << SOC_ETM_TG0_TASK_CNT_STOP_TIMER0_ST_S)
#define SOC_ETM_TG0_TASK_CNT_STOP_TIMER0_ST_V  0x00000001U
#define SOC_ETM_TG0_TASK_CNT_STOP_TIMER0_ST_S  30
/** SOC_ETM_TG0_TASK_CNT_RELOAD_TIMER0_ST : R/WTC/SS; bitpos: [31]; default: 0;
 *  Represents TG0_task_cnt_reload_timer0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TG0_TASK_CNT_RELOAD_TIMER0_ST    (BIT(31))
#define SOC_ETM_TG0_TASK_CNT_RELOAD_TIMER0_ST_M  (SOC_ETM_TG0_TASK_CNT_RELOAD_TIMER0_ST_V << SOC_ETM_TG0_TASK_CNT_RELOAD_TIMER0_ST_S)
#define SOC_ETM_TG0_TASK_CNT_RELOAD_TIMER0_ST_V  0x00000001U
#define SOC_ETM_TG0_TASK_CNT_RELOAD_TIMER0_ST_S  31

