espressif/esp-idf/components/soc/esp32h4/register/soc/soc_etm_reg.h
/** SOC_ETM_TASK_ST4_CLR_REG register
 *  Tasks trigger status clear register
 */
#define SOC_ETM_TASK_ST4_CLR_REG (DR_REG_SOC_ETM_BASE + 0x204)
/** SOC_ETM_MCPWM1_TASK_CMPR1_B_UP_ST_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_cmpr1_b_up trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_CMPR1_B_UP_ST_CLR    (BIT(0))
#define SOC_ETM_MCPWM1_TASK_CMPR1_B_UP_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_CMPR1_B_UP_ST_CLR_V << SOC_ETM_MCPWM1_TASK_CMPR1_B_UP_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_CMPR1_B_UP_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_CMPR1_B_UP_ST_CLR_S  0
/** SOC_ETM_MCPWM1_TASK_CMPR2_B_UP_ST_CLR : WT; bitpos: [1]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_cmpr2_b_up trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_CMPR2_B_UP_ST_CLR    (BIT(1))
#define SOC_ETM_MCPWM1_TASK_CMPR2_B_UP_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_CMPR2_B_UP_ST_CLR_V << SOC_ETM_MCPWM1_TASK_CMPR2_B_UP_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_CMPR2_B_UP_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_CMPR2_B_UP_ST_CLR_S  1
/** SOC_ETM_MCPWM1_TASK_GEN_STOP_ST_CLR : WT; bitpos: [2]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_gen_stop trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_GEN_STOP_ST_CLR    (BIT(2))
#define SOC_ETM_MCPWM1_TASK_GEN_STOP_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_GEN_STOP_ST_CLR_V << SOC_ETM_MCPWM1_TASK_GEN_STOP_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_GEN_STOP_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_GEN_STOP_ST_CLR_S  2
/** SOC_ETM_MCPWM1_TASK_TIMER0_SYN_ST_CLR : WT; bitpos: [3]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_timer0_syn trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_TIMER0_SYN_ST_CLR    (BIT(3))
#define SOC_ETM_MCPWM1_TASK_TIMER0_SYN_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_TIMER0_SYN_ST_CLR_V << SOC_ETM_MCPWM1_TASK_TIMER0_SYN_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_TIMER0_SYN_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_TIMER0_SYN_ST_CLR_S  3
/** SOC_ETM_MCPWM1_TASK_TIMER1_SYN_ST_CLR : WT; bitpos: [4]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_timer1_syn trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_TIMER1_SYN_ST_CLR    (BIT(4))
#define SOC_ETM_MCPWM1_TASK_TIMER1_SYN_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_TIMER1_SYN_ST_CLR_V << SOC_ETM_MCPWM1_TASK_TIMER1_SYN_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_TIMER1_SYN_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_TIMER1_SYN_ST_CLR_S  4
/** SOC_ETM_MCPWM1_TASK_TIMER2_SYN_ST_CLR : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_timer2_syn trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_TIMER2_SYN_ST_CLR    (BIT(5))
#define SOC_ETM_MCPWM1_TASK_TIMER2_SYN_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_TIMER2_SYN_ST_CLR_V << SOC_ETM_MCPWM1_TASK_TIMER2_SYN_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_TIMER2_SYN_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_TIMER2_SYN_ST_CLR_S  5
/** SOC_ETM_MCPWM1_TASK_TIMER0_PERIOD_UP_ST_CLR : WT; bitpos: [6]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_timer0_period_up trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_TIMER0_PERIOD_UP_ST_CLR    (BIT(6))
#define SOC_ETM_MCPWM1_TASK_TIMER0_PERIOD_UP_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_TIMER0_PERIOD_UP_ST_CLR_V << SOC_ETM_MCPWM1_TASK_TIMER0_PERIOD_UP_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_TIMER0_PERIOD_UP_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_TIMER0_PERIOD_UP_ST_CLR_S  6
/** SOC_ETM_MCPWM1_TASK_TIMER1_PERIOD_UP_ST_CLR : WT; bitpos: [7]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_timer1_period_up trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_TIMER1_PERIOD_UP_ST_CLR    (BIT(7))
#define SOC_ETM_MCPWM1_TASK_TIMER1_PERIOD_UP_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_TIMER1_PERIOD_UP_ST_CLR_V << SOC_ETM_MCPWM1_TASK_TIMER1_PERIOD_UP_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_TIMER1_PERIOD_UP_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_TIMER1_PERIOD_UP_ST_CLR_S  7
/** SOC_ETM_MCPWM1_TASK_TIMER2_PERIOD_UP_ST_CLR : WT; bitpos: [8]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_timer2_period_up trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_TIMER2_PERIOD_UP_ST_CLR    (BIT(8))
#define SOC_ETM_MCPWM1_TASK_TIMER2_PERIOD_UP_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_TIMER2_PERIOD_UP_ST_CLR_V << SOC_ETM_MCPWM1_TASK_TIMER2_PERIOD_UP_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_TIMER2_PERIOD_UP_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_TIMER2_PERIOD_UP_ST_CLR_S  8
/** SOC_ETM_MCPWM1_TASK_TZ0_OST_ST_CLR : WT; bitpos: [9]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_tz0_ost trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_TZ0_OST_ST_CLR    (BIT(9))
#define SOC_ETM_MCPWM1_TASK_TZ0_OST_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_TZ0_OST_ST_CLR_V << SOC_ETM_MCPWM1_TASK_TZ0_OST_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_TZ0_OST_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_TZ0_OST_ST_CLR_S  9
/** SOC_ETM_MCPWM1_TASK_TZ1_OST_ST_CLR : WT; bitpos: [10]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_tz1_ost trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_TZ1_OST_ST_CLR    (BIT(10))
#define SOC_ETM_MCPWM1_TASK_TZ1_OST_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_TZ1_OST_ST_CLR_V << SOC_ETM_MCPWM1_TASK_TZ1_OST_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_TZ1_OST_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_TZ1_OST_ST_CLR_S  10
/** SOC_ETM_MCPWM1_TASK_TZ2_OST_ST_CLR : WT; bitpos: [11]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_tz2_ost trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_TZ2_OST_ST_CLR    (BIT(11))
#define SOC_ETM_MCPWM1_TASK_TZ2_OST_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_TZ2_OST_ST_CLR_V << SOC_ETM_MCPWM1_TASK_TZ2_OST_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_TZ2_OST_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_TZ2_OST_ST_CLR_S  11
/** SOC_ETM_MCPWM1_TASK_CLR0_OST_ST_CLR : WT; bitpos: [12]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_clr0_ost trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_CLR0_OST_ST_CLR    (BIT(12))
#define SOC_ETM_MCPWM1_TASK_CLR0_OST_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_CLR0_OST_ST_CLR_V << SOC_ETM_MCPWM1_TASK_CLR0_OST_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_CLR0_OST_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_CLR0_OST_ST_CLR_S  12
/** SOC_ETM_MCPWM1_TASK_CLR1_OST_ST_CLR : WT; bitpos: [13]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_clr1_ost trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_CLR1_OST_ST_CLR    (BIT(13))
#define SOC_ETM_MCPWM1_TASK_CLR1_OST_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_CLR1_OST_ST_CLR_V << SOC_ETM_MCPWM1_TASK_CLR1_OST_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_CLR1_OST_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_CLR1_OST_ST_CLR_S  13
/** SOC_ETM_MCPWM1_TASK_CLR2_OST_ST_CLR : WT; bitpos: [14]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_clr2_ost trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_CLR2_OST_ST_CLR    (BIT(14))
#define SOC_ETM_MCPWM1_TASK_CLR2_OST_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_CLR2_OST_ST_CLR_V << SOC_ETM_MCPWM1_TASK_CLR2_OST_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_CLR2_OST_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_CLR2_OST_ST_CLR_S  14
/** SOC_ETM_MCPWM1_TASK_CAP0_ST_CLR : WT; bitpos: [15]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_cap0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_CAP0_ST_CLR    (BIT(15))
#define SOC_ETM_MCPWM1_TASK_CAP0_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_CAP0_ST_CLR_V << SOC_ETM_MCPWM1_TASK_CAP0_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_CAP0_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_CAP0_ST_CLR_S  15
/** SOC_ETM_MCPWM1_TASK_CAP1_ST_CLR : WT; bitpos: [16]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_cap1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_CAP1_ST_CLR    (BIT(16))
#define SOC_ETM_MCPWM1_TASK_CAP1_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_CAP1_ST_CLR_V << SOC_ETM_MCPWM1_TASK_CAP1_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_CAP1_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_CAP1_ST_CLR_S  16
/** SOC_ETM_MCPWM1_TASK_CAP2_ST_CLR : WT; bitpos: [17]; default: 0;
 *  Configures whether or not to clear MCPWM1_task_cap2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM1_TASK_CAP2_ST_CLR    (BIT(17))
#define SOC_ETM_MCPWM1_TASK_CAP2_ST_CLR_M  (SOC_ETM_MCPWM1_TASK_CAP2_ST_CLR_V << SOC_ETM_MCPWM1_TASK_CAP2_ST_CLR_S)
#define SOC_ETM_MCPWM1_TASK_CAP2_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM1_TASK_CAP2_ST_CLR_S  17
/** SOC_ETM_ADC_TASK_SAMPLE0_ST_CLR : WT; bitpos: [18]; default: 0;
 *  Configures whether or not to clear ADC_task_sample0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ADC_TASK_SAMPLE0_ST_CLR    (BIT(18))
#define SOC_ETM_ADC_TASK_SAMPLE0_ST_CLR_M  (SOC_ETM_ADC_TASK_SAMPLE0_ST_CLR_V << SOC_ETM_ADC_TASK_SAMPLE0_ST_CLR_S)
#define SOC_ETM_ADC_TASK_SAMPLE0_ST_CLR_V  0x00000001U
#define SOC_ETM_ADC_TASK_SAMPLE0_ST_CLR_S  18
/** SOC_ETM_ADC_TASK_SAMPLE1_ST_CLR : WT; bitpos: [19]; default: 0;
 *  Configures whether or not to clear ADC_task_sample1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ADC_TASK_SAMPLE1_ST_CLR    (BIT(19))
#define SOC_ETM_ADC_TASK_SAMPLE1_ST_CLR_M  (SOC_ETM_ADC_TASK_SAMPLE1_ST_CLR_V << SOC_ETM_ADC_TASK_SAMPLE1_ST_CLR_S)
#define SOC_ETM_ADC_TASK_SAMPLE1_ST_CLR_V  0x00000001U
#define SOC_ETM_ADC_TASK_SAMPLE1_ST_CLR_S  19
/** SOC_ETM_ADC_TASK_START0_ST_CLR : WT; bitpos: [20]; default: 0;
 *  Configures whether or not to clear ADC_task_start0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ADC_TASK_START0_ST_CLR    (BIT(20))
#define SOC_ETM_ADC_TASK_START0_ST_CLR_M  (SOC_ETM_ADC_TASK_START0_ST_CLR_V << SOC_ETM_ADC_TASK_START0_ST_CLR_S)
#define SOC_ETM_ADC_TASK_START0_ST_CLR_V  0x00000001U
#define SOC_ETM_ADC_TASK_START0_ST_CLR_S  20
/** SOC_ETM_ADC_TASK_STOP0_ST_CLR : WT; bitpos: [21]; default: 0;
 *  Configures whether or not to clear ADC_task_stop0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ADC_TASK_STOP0_ST_CLR    (BIT(21))
#define SOC_ETM_ADC_TASK_STOP0_ST_CLR_M  (SOC_ETM_ADC_TASK_STOP0_ST_CLR_V << SOC_ETM_ADC_TASK_STOP0_ST_CLR_S)
#define SOC_ETM_ADC_TASK_STOP0_ST_CLR_V  0x00000001U
#define SOC_ETM_ADC_TASK_STOP0_ST_CLR_S  21
/** SOC_ETM_REGDMA_TASK_START0_ST_CLR : WT; bitpos: [22]; default: 0;
 *  Configures whether or not to clear REGDMA_task_start0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_TASK_START0_ST_CLR    (BIT(22))
#define SOC_ETM_REGDMA_TASK_START0_ST_CLR_M  (SOC_ETM_REGDMA_TASK_START0_ST_CLR_V << SOC_ETM_REGDMA_TASK_START0_ST_CLR_S)
#define SOC_ETM_REGDMA_TASK_START0_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_TASK_START0_ST_CLR_S  22
/** SOC_ETM_REGDMA_TASK_START1_ST_CLR : WT; bitpos: [23]; default: 0;
 *  Configures whether or not to clear REGDMA_task_start1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_TASK_START1_ST_CLR    (BIT(23))
#define SOC_ETM_REGDMA_TASK_START1_ST_CLR_M  (SOC_ETM_REGDMA_TASK_START1_ST_CLR_V << SOC_ETM_REGDMA_TASK_START1_ST_CLR_S)
#define SOC_ETM_REGDMA_TASK_START1_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_TASK_START1_ST_CLR_S  23
/** SOC_ETM_REGDMA_TASK_START2_ST_CLR : WT; bitpos: [24]; default: 0;
 *  Configures whether or not to clear REGDMA_task_start2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_TASK_START2_ST_CLR    (BIT(24))
#define SOC_ETM_REGDMA_TASK_START2_ST_CLR_M  (SOC_ETM_REGDMA_TASK_START2_ST_CLR_V << SOC_ETM_REGDMA_TASK_START2_ST_CLR_S)
#define SOC_ETM_REGDMA_TASK_START2_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_TASK_START2_ST_CLR_S  24
/** SOC_ETM_REGDMA_TASK_START3_ST_CLR : WT; bitpos: [25]; default: 0;
 *  Configures whether or not to clear REGDMA_task_start3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_TASK_START3_ST_CLR    (BIT(25))
#define SOC_ETM_REGDMA_TASK_START3_ST_CLR_M  (SOC_ETM_REGDMA_TASK_START3_ST_CLR_V << SOC_ETM_REGDMA_TASK_START3_ST_CLR_S)
#define SOC_ETM_REGDMA_TASK_START3_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_TASK_START3_ST_CLR_S  25
/** SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_CLR : WT; bitpos: [26]; default: 0;
 *  Configures whether or not to clear TMPSNSR_task_start_sample trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_CLR    (BIT(26))
#define SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_CLR_M  (SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_CLR_V << SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_CLR_S)
#define SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_CLR_V  0x00000001U
#define SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_CLR_S  26
/** SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_CLR : WT; bitpos: [27]; default: 0;
 *  Configures whether or not to clear TMPSNSR_task_stop_sample trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_CLR    (BIT(27))
#define SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_CLR_M  (SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_CLR_V << SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_CLR_S)
#define SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_CLR_V  0x00000001U
#define SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_CLR_S  27
/** SOC_ETM_I2S0_TASK_START_RX_ST_CLR : WT; bitpos: [28]; default: 0;
 *  Configures whether or not to clear I2S0_task_start_rx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S0_TASK_START_RX_ST_CLR    (BIT(28))
#define SOC_ETM_I2S0_TASK_START_RX_ST_CLR_M  (SOC_ETM_I2S0_TASK_START_RX_ST_CLR_V << SOC_ETM_I2S0_TASK_START_RX_ST_CLR_S)
#define SOC_ETM_I2S0_TASK_START_RX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S0_TASK_START_RX_ST_CLR_S  28
/** SOC_ETM_I2S0_TASK_START_TX_ST_CLR : WT; bitpos: [29]; default: 0;
 *  Configures whether or not to clear I2S0_task_start_tx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S0_TASK_START_TX_ST_CLR    (BIT(29))
#define SOC_ETM_I2S0_TASK_START_TX_ST_CLR_M  (SOC_ETM_I2S0_TASK_START_TX_ST_CLR_V << SOC_ETM_I2S0_TASK_START_TX_ST_CLR_S)
#define SOC_ETM_I2S0_TASK_START_TX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S0_TASK_START_TX_ST_CLR_S  29
/** SOC_ETM_I2S0_TASK_STOP_RX_ST_CLR : WT; bitpos: [30]; default: 0;
 *  Configures whether or not to clear I2S0_task_stop_rx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S0_TASK_STOP_RX_ST_CLR    (BIT(30))
#define SOC_ETM_I2S0_TASK_STOP_RX_ST_CLR_M  (SOC_ETM_I2S0_TASK_STOP_RX_ST_CLR_V << SOC_ETM_I2S0_TASK_STOP_RX_ST_CLR_S)
#define SOC_ETM_I2S0_TASK_STOP_RX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S0_TASK_STOP_RX_ST_CLR_S  30
/** SOC_ETM_I2S0_TASK_STOP_TX_ST_CLR : WT; bitpos: [31]; default: 0;
 *  Configures whether or not to clear I2S0_task_stop_tx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S0_TASK_STOP_TX_ST_CLR    (BIT(31))
#define SOC_ETM_I2S0_TASK_STOP_TX_ST_CLR_M  (SOC_ETM_I2S0_TASK_STOP_TX_ST_CLR_V << SOC_ETM_I2S0_TASK_STOP_TX_ST_CLR_S)
#define SOC_ETM_I2S0_TASK_STOP_TX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S0_TASK_STOP_TX_ST_CLR_S  31

