espressif/esp-idf/components/soc/esp32h4/register/soc/soc_etm_reg.h
/** SOC_ETM_TASK_ST5_REG register
 *  Tasks trigger status register
 */
#define SOC_ETM_TASK_ST5_REG (DR_REG_SOC_ETM_BASE + 0x208)
/** SOC_ETM_I2S0_TASK_SYNC_CHECK_ST : R/WTC/SS; bitpos: [0]; default: 0;
 *  Represents I2S0_task_sync_check trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S0_TASK_SYNC_CHECK_ST    (BIT(0))
#define SOC_ETM_I2S0_TASK_SYNC_CHECK_ST_M  (SOC_ETM_I2S0_TASK_SYNC_CHECK_ST_V << SOC_ETM_I2S0_TASK_SYNC_CHECK_ST_S)
#define SOC_ETM_I2S0_TASK_SYNC_CHECK_ST_V  0x00000001U
#define SOC_ETM_I2S0_TASK_SYNC_CHECK_ST_S  0
/** SOC_ETM_ULP_TASK_WAKEUP_CPU_ST : R/WTC/SS; bitpos: [1]; default: 0;
 *  Represents ULP_task_wakeup_cpu trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST    (BIT(1))
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_M  (SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_V << SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_S)
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_V  0x00000001U
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_S  1
/** SOC_ETM_ULP_TASK_INT_CPU_ST : R/WTC/SS; bitpos: [2]; default: 0;
 *  Represents ULP_task_int_cpu trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ULP_TASK_INT_CPU_ST    (BIT(2))
#define SOC_ETM_ULP_TASK_INT_CPU_ST_M  (SOC_ETM_ULP_TASK_INT_CPU_ST_V << SOC_ETM_ULP_TASK_INT_CPU_ST_S)
#define SOC_ETM_ULP_TASK_INT_CPU_ST_V  0x00000001U
#define SOC_ETM_ULP_TASK_INT_CPU_ST_S  2
/** SOC_ETM_RTC_TASK_START_ST : R/WTC/SS; bitpos: [3]; default: 0;
 *  Represents RTC_task_start trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_RTC_TASK_START_ST    (BIT(3))
#define SOC_ETM_RTC_TASK_START_ST_M  (SOC_ETM_RTC_TASK_START_ST_V << SOC_ETM_RTC_TASK_START_ST_S)
#define SOC_ETM_RTC_TASK_START_ST_V  0x00000001U
#define SOC_ETM_RTC_TASK_START_ST_S  3
/** SOC_ETM_RTC_TASK_STOP_ST : R/WTC/SS; bitpos: [4]; default: 0;
 *  Represents RTC_task_stop trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_RTC_TASK_STOP_ST    (BIT(4))
#define SOC_ETM_RTC_TASK_STOP_ST_M  (SOC_ETM_RTC_TASK_STOP_ST_V << SOC_ETM_RTC_TASK_STOP_ST_S)
#define SOC_ETM_RTC_TASK_STOP_ST_V  0x00000001U
#define SOC_ETM_RTC_TASK_STOP_ST_S  4
/** SOC_ETM_RTC_TASK_CLR_ST : R/WTC/SS; bitpos: [5]; default: 0;
 *  Represents RTC_task_clr trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_RTC_TASK_CLR_ST    (BIT(5))
#define SOC_ETM_RTC_TASK_CLR_ST_M  (SOC_ETM_RTC_TASK_CLR_ST_V << SOC_ETM_RTC_TASK_CLR_ST_S)
#define SOC_ETM_RTC_TASK_CLR_ST_V  0x00000001U
#define SOC_ETM_RTC_TASK_CLR_ST_S  5
/** SOC_ETM_RTC_TASK_TRIGGERFLW_ST : R/WTC/SS; bitpos: [6]; default: 0;
 *  Represents RTC_task_triggerflw trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST    (BIT(6))
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST_M  (SOC_ETM_RTC_TASK_TRIGGERFLW_ST_V << SOC_ETM_RTC_TASK_TRIGGERFLW_ST_S)
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST_V  0x00000001U
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST_S  6
/** SOC_ETM_GDMA_TASK_IN_START_CH0_ST : R/WTC/SS; bitpos: [7]; default: 0;
 *  Represents GDMA_task_in_start_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_TASK_IN_START_CH0_ST    (BIT(7))
#define SOC_ETM_GDMA_TASK_IN_START_CH0_ST_M  (SOC_ETM_GDMA_TASK_IN_START_CH0_ST_V << SOC_ETM_GDMA_TASK_IN_START_CH0_ST_S)
#define SOC_ETM_GDMA_TASK_IN_START_CH0_ST_V  0x00000001U
#define SOC_ETM_GDMA_TASK_IN_START_CH0_ST_S  7
/** SOC_ETM_GDMA_TASK_IN_START_CH1_ST : R/WTC/SS; bitpos: [8]; default: 0;
 *  Represents GDMA_task_in_start_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_TASK_IN_START_CH1_ST    (BIT(8))
#define SOC_ETM_GDMA_TASK_IN_START_CH1_ST_M  (SOC_ETM_GDMA_TASK_IN_START_CH1_ST_V << SOC_ETM_GDMA_TASK_IN_START_CH1_ST_S)
#define SOC_ETM_GDMA_TASK_IN_START_CH1_ST_V  0x00000001U
#define SOC_ETM_GDMA_TASK_IN_START_CH1_ST_S  8
/** SOC_ETM_GDMA_TASK_IN_START_CH2_ST : R/WTC/SS; bitpos: [9]; default: 0;
 *  Represents GDMA_task_in_start_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_TASK_IN_START_CH2_ST    (BIT(9))
#define SOC_ETM_GDMA_TASK_IN_START_CH2_ST_M  (SOC_ETM_GDMA_TASK_IN_START_CH2_ST_V << SOC_ETM_GDMA_TASK_IN_START_CH2_ST_S)
#define SOC_ETM_GDMA_TASK_IN_START_CH2_ST_V  0x00000001U
#define SOC_ETM_GDMA_TASK_IN_START_CH2_ST_S  9
/** SOC_ETM_GDMA_TASK_IN_START_CH3_ST : R/WTC/SS; bitpos: [10]; default: 0;
 *  Represents GDMA_task_in_start_ch3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_TASK_IN_START_CH3_ST    (BIT(10))
#define SOC_ETM_GDMA_TASK_IN_START_CH3_ST_M  (SOC_ETM_GDMA_TASK_IN_START_CH3_ST_V << SOC_ETM_GDMA_TASK_IN_START_CH3_ST_S)
#define SOC_ETM_GDMA_TASK_IN_START_CH3_ST_V  0x00000001U
#define SOC_ETM_GDMA_TASK_IN_START_CH3_ST_S  10
/** SOC_ETM_GDMA_TASK_IN_START_CH4_ST : R/WTC/SS; bitpos: [11]; default: 0;
 *  Represents GDMA_task_in_start_ch4 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_TASK_IN_START_CH4_ST    (BIT(11))
#define SOC_ETM_GDMA_TASK_IN_START_CH4_ST_M  (SOC_ETM_GDMA_TASK_IN_START_CH4_ST_V << SOC_ETM_GDMA_TASK_IN_START_CH4_ST_S)
#define SOC_ETM_GDMA_TASK_IN_START_CH4_ST_V  0x00000001U
#define SOC_ETM_GDMA_TASK_IN_START_CH4_ST_S  11
/** SOC_ETM_GDMA_TASK_OUT_START_CH0_ST : R/WTC/SS; bitpos: [12]; default: 0;
 *  Represents GDMA_task_out_start_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_TASK_OUT_START_CH0_ST    (BIT(12))
#define SOC_ETM_GDMA_TASK_OUT_START_CH0_ST_M  (SOC_ETM_GDMA_TASK_OUT_START_CH0_ST_V << SOC_ETM_GDMA_TASK_OUT_START_CH0_ST_S)
#define SOC_ETM_GDMA_TASK_OUT_START_CH0_ST_V  0x00000001U
#define SOC_ETM_GDMA_TASK_OUT_START_CH0_ST_S  12
/** SOC_ETM_GDMA_TASK_OUT_START_CH1_ST : R/WTC/SS; bitpos: [13]; default: 0;
 *  Represents GDMA_task_out_start_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_TASK_OUT_START_CH1_ST    (BIT(13))
#define SOC_ETM_GDMA_TASK_OUT_START_CH1_ST_M  (SOC_ETM_GDMA_TASK_OUT_START_CH1_ST_V << SOC_ETM_GDMA_TASK_OUT_START_CH1_ST_S)
#define SOC_ETM_GDMA_TASK_OUT_START_CH1_ST_V  0x00000001U
#define SOC_ETM_GDMA_TASK_OUT_START_CH1_ST_S  13
/** SOC_ETM_GDMA_TASK_OUT_START_CH2_ST : R/WTC/SS; bitpos: [14]; default: 0;
 *  Represents GDMA_task_out_start_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_TASK_OUT_START_CH2_ST    (BIT(14))
#define SOC_ETM_GDMA_TASK_OUT_START_CH2_ST_M  (SOC_ETM_GDMA_TASK_OUT_START_CH2_ST_V << SOC_ETM_GDMA_TASK_OUT_START_CH2_ST_S)
#define SOC_ETM_GDMA_TASK_OUT_START_CH2_ST_V  0x00000001U
#define SOC_ETM_GDMA_TASK_OUT_START_CH2_ST_S  14
/** SOC_ETM_GDMA_TASK_OUT_START_CH3_ST : R/WTC/SS; bitpos: [15]; default: 0;
 *  Represents GDMA_task_out_start_ch3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_TASK_OUT_START_CH3_ST    (BIT(15))
#define SOC_ETM_GDMA_TASK_OUT_START_CH3_ST_M  (SOC_ETM_GDMA_TASK_OUT_START_CH3_ST_V << SOC_ETM_GDMA_TASK_OUT_START_CH3_ST_S)
#define SOC_ETM_GDMA_TASK_OUT_START_CH3_ST_V  0x00000001U
#define SOC_ETM_GDMA_TASK_OUT_START_CH3_ST_S  15
/** SOC_ETM_GDMA_TASK_OUT_START_CH4_ST : R/WTC/SS; bitpos: [16]; default: 0;
 *  Represents GDMA_task_out_start_ch4 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_TASK_OUT_START_CH4_ST    (BIT(16))
#define SOC_ETM_GDMA_TASK_OUT_START_CH4_ST_M  (SOC_ETM_GDMA_TASK_OUT_START_CH4_ST_V << SOC_ETM_GDMA_TASK_OUT_START_CH4_ST_S)
#define SOC_ETM_GDMA_TASK_OUT_START_CH4_ST_V  0x00000001U
#define SOC_ETM_GDMA_TASK_OUT_START_CH4_ST_S  16
/** SOC_ETM_PMU_TASK_SLEEP_REQ_ST : R/WTC/SS; bitpos: [17]; default: 0;
 *  Represents PMU_task_sleep_req trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST    (BIT(17))
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST_M  (SOC_ETM_PMU_TASK_SLEEP_REQ_ST_V << SOC_ETM_PMU_TASK_SLEEP_REQ_ST_S)
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST_V  0x00000001U
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST_S  17
/** SOC_ETM_MODEM_TASK_G0_ST : R/WTC/SS; bitpos: [18]; default: 0;
 *  Represents MODEM_task_g0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_TASK_G0_ST    (BIT(18))
#define SOC_ETM_MODEM_TASK_G0_ST_M  (SOC_ETM_MODEM_TASK_G0_ST_V << SOC_ETM_MODEM_TASK_G0_ST_S)
#define SOC_ETM_MODEM_TASK_G0_ST_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G0_ST_S  18
/** SOC_ETM_MODEM_TASK_G1_ST : R/WTC/SS; bitpos: [19]; default: 0;
 *  Represents MODEM_task_g1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_TASK_G1_ST    (BIT(19))
#define SOC_ETM_MODEM_TASK_G1_ST_M  (SOC_ETM_MODEM_TASK_G1_ST_V << SOC_ETM_MODEM_TASK_G1_ST_S)
#define SOC_ETM_MODEM_TASK_G1_ST_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G1_ST_S  19
/** SOC_ETM_MODEM_TASK_G2_ST : R/WTC/SS; bitpos: [20]; default: 0;
 *  Represents MODEM_task_g2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_TASK_G2_ST    (BIT(20))
#define SOC_ETM_MODEM_TASK_G2_ST_M  (SOC_ETM_MODEM_TASK_G2_ST_V << SOC_ETM_MODEM_TASK_G2_ST_S)
#define SOC_ETM_MODEM_TASK_G2_ST_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G2_ST_S  20
/** SOC_ETM_MODEM_TASK_G3_ST : R/WTC/SS; bitpos: [21]; default: 0;
 *  Represents MODEM_task_g3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_TASK_G3_ST    (BIT(21))
#define SOC_ETM_MODEM_TASK_G3_ST_M  (SOC_ETM_MODEM_TASK_G3_ST_V << SOC_ETM_MODEM_TASK_G3_ST_S)
#define SOC_ETM_MODEM_TASK_G3_ST_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G3_ST_S  21
/** SOC_ETM_ZERO_DET_TASK_START_ST : R/WTC/SS; bitpos: [22]; default: 0;
 *  Represents ZERO_DET_task_start trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ZERO_DET_TASK_START_ST    (BIT(22))
#define SOC_ETM_ZERO_DET_TASK_START_ST_M  (SOC_ETM_ZERO_DET_TASK_START_ST_V << SOC_ETM_ZERO_DET_TASK_START_ST_S)
#define SOC_ETM_ZERO_DET_TASK_START_ST_V  0x00000001U
#define SOC_ETM_ZERO_DET_TASK_START_ST_S  22

/** SOC_ETM_TASK_ST5_CLR_REG register
 *  Tasks trigger status clear register
 */
#define SOC_ETM_TASK_ST5_CLR_REG (DR_REG_SOC_ETM_BASE + 0x20c)
/** SOC_ETM_I2S0_TASK_SYNC_CHECK_ST_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear I2S0_task_sync_check trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S0_TASK_SYNC_CHECK_ST_CLR    (BIT(0))
#define SOC_ETM_I2S0_TASK_SYNC_CHECK_ST_CLR_M  (SOC_ETM_I2S0_TASK_SYNC_CHECK_ST_CLR_V << SOC_ETM_I2S0_TASK_SYNC_CHECK_ST_CLR_S)
#define SOC_ETM_I2S0_TASK_SYNC_CHECK_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S0_TASK_SYNC_CHECK_ST_CLR_S  0
/** SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_CLR : WT; bitpos: [1]; default: 0;
 *  Configures whether or not to clear ULP_task_wakeup_cpu trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_CLR    (BIT(1))
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_CLR_M  (SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_CLR_V << SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_CLR_S)
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_CLR_V  0x00000001U
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_CLR_S  1
/** SOC_ETM_ULP_TASK_INT_CPU_ST_CLR : WT; bitpos: [2]; default: 0;
 *  Configures whether or not to clear ULP_task_int_cpu trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ULP_TASK_INT_CPU_ST_CLR    (BIT(2))
#define SOC_ETM_ULP_TASK_INT_CPU_ST_CLR_M  (SOC_ETM_ULP_TASK_INT_CPU_ST_CLR_V << SOC_ETM_ULP_TASK_INT_CPU_ST_CLR_S)
#define SOC_ETM_ULP_TASK_INT_CPU_ST_CLR_V  0x00000001U
#define SOC_ETM_ULP_TASK_INT_CPU_ST_CLR_S  2
/** SOC_ETM_RTC_TASK_START_ST_CLR : WT; bitpos: [3]; default: 0;
 *  Configures whether or not to clear RTC_task_start trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_RTC_TASK_START_ST_CLR    (BIT(3))
#define SOC_ETM_RTC_TASK_START_ST_CLR_M  (SOC_ETM_RTC_TASK_START_ST_CLR_V << SOC_ETM_RTC_TASK_START_ST_CLR_S)
#define SOC_ETM_RTC_TASK_START_ST_CLR_V  0x00000001U
#define SOC_ETM_RTC_TASK_START_ST_CLR_S  3
/** SOC_ETM_RTC_TASK_STOP_ST_CLR : WT; bitpos: [4]; default: 0;
 *  Configures whether or not to clear RTC_task_stop trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_RTC_TASK_STOP_ST_CLR    (BIT(4))
#define SOC_ETM_RTC_TASK_STOP_ST_CLR_M  (SOC_ETM_RTC_TASK_STOP_ST_CLR_V << SOC_ETM_RTC_TASK_STOP_ST_CLR_S)
#define SOC_ETM_RTC_TASK_STOP_ST_CLR_V  0x00000001U
#define SOC_ETM_RTC_TASK_STOP_ST_CLR_S  4
/** SOC_ETM_RTC_TASK_CLR_ST_CLR : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to clear RTC_task_clr trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_RTC_TASK_CLR_ST_CLR    (BIT(5))
#define SOC_ETM_RTC_TASK_CLR_ST_CLR_M  (SOC_ETM_RTC_TASK_CLR_ST_CLR_V << SOC_ETM_RTC_TASK_CLR_ST_CLR_S)
#define SOC_ETM_RTC_TASK_CLR_ST_CLR_V  0x00000001U
#define SOC_ETM_RTC_TASK_CLR_ST_CLR_S  5
/** SOC_ETM_RTC_TASK_TRIGGERFLW_ST_CLR : WT; bitpos: [6]; default: 0;
 *  Configures whether or not to clear RTC_task_triggerflw trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST_CLR    (BIT(6))
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST_CLR_M  (SOC_ETM_RTC_TASK_TRIGGERFLW_ST_CLR_V << SOC_ETM_RTC_TASK_TRIGGERFLW_ST_CLR_S)
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST_CLR_V  0x00000001U
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST_CLR_S  6
/** SOC_ETM_GDMA_TASK_IN_START_CH0_ST_CLR : WT; bitpos: [7]; default: 0;
 *  Configures whether or not to clear GDMA_task_in_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_GDMA_TASK_IN_START_CH0_ST_CLR    (BIT(7))
#define SOC_ETM_GDMA_TASK_IN_START_CH0_ST_CLR_M  (SOC_ETM_GDMA_TASK_IN_START_CH0_ST_CLR_V << SOC_ETM_GDMA_TASK_IN_START_CH0_ST_CLR_S)
#define SOC_ETM_GDMA_TASK_IN_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_GDMA_TASK_IN_START_CH0_ST_CLR_S  7
/** SOC_ETM_GDMA_TASK_IN_START_CH1_ST_CLR : WT; bitpos: [8]; default: 0;
 *  Configures whether or not to clear GDMA_task_in_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_GDMA_TASK_IN_START_CH1_ST_CLR    (BIT(8))
#define SOC_ETM_GDMA_TASK_IN_START_CH1_ST_CLR_M  (SOC_ETM_GDMA_TASK_IN_START_CH1_ST_CLR_V << SOC_ETM_GDMA_TASK_IN_START_CH1_ST_CLR_S)
#define SOC_ETM_GDMA_TASK_IN_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_GDMA_TASK_IN_START_CH1_ST_CLR_S  8
/** SOC_ETM_GDMA_TASK_IN_START_CH2_ST_CLR : WT; bitpos: [9]; default: 0;
 *  Configures whether or not to clear GDMA_task_in_start_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_GDMA_TASK_IN_START_CH2_ST_CLR    (BIT(9))
#define SOC_ETM_GDMA_TASK_IN_START_CH2_ST_CLR_M  (SOC_ETM_GDMA_TASK_IN_START_CH2_ST_CLR_V << SOC_ETM_GDMA_TASK_IN_START_CH2_ST_CLR_S)
#define SOC_ETM_GDMA_TASK_IN_START_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_GDMA_TASK_IN_START_CH2_ST_CLR_S  9
/** SOC_ETM_GDMA_TASK_IN_START_CH3_ST_CLR : WT; bitpos: [10]; default: 0;
 *  Configures whether or not to clear GDMA_task_in_start_ch3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_GDMA_TASK_IN_START_CH3_ST_CLR    (BIT(10))
#define SOC_ETM_GDMA_TASK_IN_START_CH3_ST_CLR_M  (SOC_ETM_GDMA_TASK_IN_START_CH3_ST_CLR_V << SOC_ETM_GDMA_TASK_IN_START_CH3_ST_CLR_S)
#define SOC_ETM_GDMA_TASK_IN_START_CH3_ST_CLR_V  0x00000001U
#define SOC_ETM_GDMA_TASK_IN_START_CH3_ST_CLR_S  10
/** SOC_ETM_GDMA_TASK_IN_START_CH4_ST_CLR : WT; bitpos: [11]; default: 0;
 *  Configures whether or not to clear GDMA_task_in_start_ch4 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_GDMA_TASK_IN_START_CH4_ST_CLR    (BIT(11))
#define SOC_ETM_GDMA_TASK_IN_START_CH4_ST_CLR_M  (SOC_ETM_GDMA_TASK_IN_START_CH4_ST_CLR_V << SOC_ETM_GDMA_TASK_IN_START_CH4_ST_CLR_S)
#define SOC_ETM_GDMA_TASK_IN_START_CH4_ST_CLR_V  0x00000001U
#define SOC_ETM_GDMA_TASK_IN_START_CH4_ST_CLR_S  11
/** SOC_ETM_GDMA_TASK_OUT_START_CH0_ST_CLR : WT; bitpos: [12]; default: 0;
 *  Configures whether or not to clear GDMA_task_out_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_GDMA_TASK_OUT_START_CH0_ST_CLR    (BIT(12))
#define SOC_ETM_GDMA_TASK_OUT_START_CH0_ST_CLR_M  (SOC_ETM_GDMA_TASK_OUT_START_CH0_ST_CLR_V << SOC_ETM_GDMA_TASK_OUT_START_CH0_ST_CLR_S)
#define SOC_ETM_GDMA_TASK_OUT_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_GDMA_TASK_OUT_START_CH0_ST_CLR_S  12
/** SOC_ETM_GDMA_TASK_OUT_START_CH1_ST_CLR : WT; bitpos: [13]; default: 0;
 *  Configures whether or not to clear GDMA_task_out_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_GDMA_TASK_OUT_START_CH1_ST_CLR    (BIT(13))
#define SOC_ETM_GDMA_TASK_OUT_START_CH1_ST_CLR_M  (SOC_ETM_GDMA_TASK_OUT_START_CH1_ST_CLR_V << SOC_ETM_GDMA_TASK_OUT_START_CH1_ST_CLR_S)
#define SOC_ETM_GDMA_TASK_OUT_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_GDMA_TASK_OUT_START_CH1_ST_CLR_S  13
/** SOC_ETM_GDMA_TASK_OUT_START_CH2_ST_CLR : WT; bitpos: [14]; default: 0;
 *  Configures whether or not to clear GDMA_task_out_start_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_GDMA_TASK_OUT_START_CH2_ST_CLR    (BIT(14))
#define SOC_ETM_GDMA_TASK_OUT_START_CH2_ST_CLR_M  (SOC_ETM_GDMA_TASK_OUT_START_CH2_ST_CLR_V << SOC_ETM_GDMA_TASK_OUT_START_CH2_ST_CLR_S)
#define SOC_ETM_GDMA_TASK_OUT_START_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_GDMA_TASK_OUT_START_CH2_ST_CLR_S  14
/** SOC_ETM_GDMA_TASK_OUT_START_CH3_ST_CLR : WT; bitpos: [15]; default: 0;
 *  Configures whether or not to clear GDMA_task_out_start_ch3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_GDMA_TASK_OUT_START_CH3_ST_CLR    (BIT(15))
#define SOC_ETM_GDMA_TASK_OUT_START_CH3_ST_CLR_M  (SOC_ETM_GDMA_TASK_OUT_START_CH3_ST_CLR_V << SOC_ETM_GDMA_TASK_OUT_START_CH3_ST_CLR_S)
#define SOC_ETM_GDMA_TASK_OUT_START_CH3_ST_CLR_V  0x00000001U
#define SOC_ETM_GDMA_TASK_OUT_START_CH3_ST_CLR_S  15
/** SOC_ETM_GDMA_TASK_OUT_START_CH4_ST_CLR : WT; bitpos: [16]; default: 0;
 *  Configures whether or not to clear GDMA_task_out_start_ch4 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_GDMA_TASK_OUT_START_CH4_ST_CLR    (BIT(16))
#define SOC_ETM_GDMA_TASK_OUT_START_CH4_ST_CLR_M  (SOC_ETM_GDMA_TASK_OUT_START_CH4_ST_CLR_V << SOC_ETM_GDMA_TASK_OUT_START_CH4_ST_CLR_S)
#define SOC_ETM_GDMA_TASK_OUT_START_CH4_ST_CLR_V  0x00000001U
#define SOC_ETM_GDMA_TASK_OUT_START_CH4_ST_CLR_S  16
/** SOC_ETM_PMU_TASK_SLEEP_REQ_ST_CLR : WT; bitpos: [17]; default: 0;
 *  Configures whether or not to clear PMU_task_sleep_req trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST_CLR    (BIT(17))
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST_CLR_M  (SOC_ETM_PMU_TASK_SLEEP_REQ_ST_CLR_V << SOC_ETM_PMU_TASK_SLEEP_REQ_ST_CLR_S)
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST_CLR_V  0x00000001U
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST_CLR_S  17
/** SOC_ETM_MODEM_TASK_G0_ST_CLR : WT; bitpos: [18]; default: 0;
 *  Configures whether or not to clear MODEM_task_g0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MODEM_TASK_G0_ST_CLR    (BIT(18))
#define SOC_ETM_MODEM_TASK_G0_ST_CLR_M  (SOC_ETM_MODEM_TASK_G0_ST_CLR_V << SOC_ETM_MODEM_TASK_G0_ST_CLR_S)
#define SOC_ETM_MODEM_TASK_G0_ST_CLR_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G0_ST_CLR_S  18
/** SOC_ETM_MODEM_TASK_G1_ST_CLR : WT; bitpos: [19]; default: 0;
 *  Configures whether or not to clear MODEM_task_g1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MODEM_TASK_G1_ST_CLR    (BIT(19))
#define SOC_ETM_MODEM_TASK_G1_ST_CLR_M  (SOC_ETM_MODEM_TASK_G1_ST_CLR_V << SOC_ETM_MODEM_TASK_G1_ST_CLR_S)
#define SOC_ETM_MODEM_TASK_G1_ST_CLR_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G1_ST_CLR_S  19
/** SOC_ETM_MODEM_TASK_G2_ST_CLR : WT; bitpos: [20]; default: 0;
 *  Configures whether or not to clear MODEM_task_g2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MODEM_TASK_G2_ST_CLR    (BIT(20))
#define SOC_ETM_MODEM_TASK_G2_ST_CLR_M  (SOC_ETM_MODEM_TASK_G2_ST_CLR_V << SOC_ETM_MODEM_TASK_G2_ST_CLR_S)
#define SOC_ETM_MODEM_TASK_G2_ST_CLR_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G2_ST_CLR_S  20
/** SOC_ETM_MODEM_TASK_G3_ST_CLR : WT; bitpos: [21]; default: 0;
 *  Configures whether or not to clear MODEM_task_g3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MODEM_TASK_G3_ST_CLR    (BIT(21))
#define SOC_ETM_MODEM_TASK_G3_ST_CLR_M  (SOC_ETM_MODEM_TASK_G3_ST_CLR_V << SOC_ETM_MODEM_TASK_G3_ST_CLR_S)
#define SOC_ETM_MODEM_TASK_G3_ST_CLR_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G3_ST_CLR_S  21
/** SOC_ETM_ZERO_DET_TASK_START_ST_CLR : WT; bitpos: [22]; default: 0;
 *  Configures whether or not to clear ZERO_DET_task_start trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ZERO_DET_TASK_START_ST_CLR    (BIT(22))
#define SOC_ETM_ZERO_DET_TASK_START_ST_CLR_M  (SOC_ETM_ZERO_DET_TASK_START_ST_CLR_V << SOC_ETM_ZERO_DET_TASK_START_ST_CLR_S)
#define SOC_ETM_ZERO_DET_TASK_START_ST_CLR_V  0x00000001U
#define SOC_ETM_ZERO_DET_TASK_START_ST_CLR_S  22

/** SOC_ETM_CLK_EN_REG register
 *  ETM clock enable register
 */
#define SOC_ETM_CLK_EN_REG (DR_REG_SOC_ETM_BASE + 0x210)
/** SOC_ETM_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to open register clock gate.
 *  0: Open the clock gate only when application writes registers
 *  1: Force open the clock gate for register
 */
#define SOC_ETM_CLK_EN    (BIT(0))
#define SOC_ETM_CLK_EN_M  (SOC_ETM_CLK_EN_V << SOC_ETM_CLK_EN_S)
#define SOC_ETM_CLK_EN_V  0x00000001U
#define SOC_ETM_CLK_EN_S  0

/** SOC_ETM_DATE_REG register
 *  ETM date register
 */
#define SOC_ETM_DATE_REG (DR_REG_SOC_ETM_BASE + 0x214)
/** SOC_ETM_DATE : R/W; bitpos: [27:0]; default: 37777745;
 *  Configures the version.
 */
#define SOC_ETM_DATE    0x0FFFFFFFU
#define SOC_ETM_DATE_M  (SOC_ETM_DATE_V << SOC_ETM_DATE_S)
#define SOC_ETM_DATE_V  0x0FFFFFFFU
#define SOC_ETM_DATE_S  0

#ifdef __cplusplus
}
#endif
